; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph0 - mode
	image1 - mode
	thermograph2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
)
(:goal (and
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 spectrograph0)
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
	(have_image Star14 image1)
	(have_image Phenomenon15 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon15 instrument2 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 10
9. (take_image satellite1 phenomenon12 instrument2 image1)
   added: (have_image phenomenon12 image1)
   goals met: 3 of 10
10. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 10
11. (take_image satellite1 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 10
12. (turn_to satellite1 phenomenon8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 10
13. (take_image satellite1 phenomenon8 instrument2 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 5 of 10
14. (turn_to satellite1 planet6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet6)
   goals met: 5 of 10
15. (take_image satellite1 planet6 instrument2 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 6 of 10
16. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 6 of 10
17. (take_image satellite1 planet7 instrument2 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 7 of 10
18. (turn_to satellite1 star10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star10)
   goals met: 7 of 10
19. (take_image satellite1 star10 instrument2 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 8 of 10
20. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 8 of 10
21. (take_image satellite1 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 9 of 10
22. (turn_to satellite1 star9 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
23. (take_image satellite1 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 10
